# НАпишите программу которая на вход принемает число N и выдает
# последовательность из N членов
#num = int(input("Введите число: "))

#result = 1
#for i in range(num):
#    print(result, end=" ")
#    result *= -3 

#num = int(input())

#for i in range(num):
    #print(3**i*(-1)**i)
#    print((-3)**i)

# Создать список длинной n значения формируются по формуле 3k+1, 
# где k принемает значение от 1 до n включительно

#n = int(input())
#a = []
#for k in range(1,n + 1):
#    a.append(3*k + 1)
#print(a)

# Напишите программу, в которой пользователь будет задвать две строки,
# программа - определяет количество вхождений одной строки в другую

#i = input()
#p = input()
#print(i.count(p))